const categories = {
  채소: {
    잎채소: ['상추', '시금치', '케일', '미나리'],
    근채류: ['당근', '감자', '고구마', '무', '연근'],
    과채류: ['토마토', '오이', '파프리카', '가지', '호박'],
    양파류: ['양파', '대파', '파'],
    특수채소: ['브로콜리', '콜리플라워', '방울양배추', '아스파라거스', '미역'],
  },
  과일: {
    사과류: ['사과'],
    배류: ['배'],
    귤류: ['오렌지', '귤', '레몬', '자몽'],
    열대과일: ['바나나', '파인애플', '망고', '아보카도'],
    베리류: ['딸기', '블루베리', '라즈베리', '블랙베리'],
    수박류: ['수박', '멜론'],
    포도류: ['포도'],
  },
  '허브 및 향신료': {
    허브: ['로즈마리', '타임', '바질', '민트', '파슬리'],
    향신료: ['고추가루', '커민', '생강', '마늘', '후추', '정향'],
  },
  뿌리채소: {
    일반뿌리채소: ['당근', '감자', '고구마', '무', '연근', '우엉', '마'],
  },
  콩류: {
    콩류: ['대두', '검은콩', '강낭콩', '렌틸콩', '병아리콩'],
  },
  '특수 농산물': {
    버섯: ['표고버섯', '느타리버섯', '양송이버섯', '신선한 송이버섯'],
    기타: ['재래식 양배추', '시래기', '쑥'],
  },
  기타: {},
};

export default categories;
